validacao/results/dvwa/no_waf/06_wrk.log
=== wrk | dvwa/no_waf | http://172.18.0.4:80 | 17/07/2026 20:43:59,21 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" http://172.18.0.4:80
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ http://172.18.0.4:80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   651.08ms    1.24s    5.00s    84.07%
    Req/Sec   726.45    536.86     4.76k    69.02%
  Latency Distribution
     50%   35.66ms
     75%  457.82ms
     90%    2.89s 
     99%    4.57s 
  160358 requests in 30.10s, 64.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 558
Requests/sec:   5327.70
Transfer/sec:      2.15MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ http://172.18.0.4:80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   704.66ms    1.22s    5.00s    82.97%
    Req/Sec   623.71    422.26     2.52k    57.86%
  Latency Distribution
     50%   34.62ms
     75%  944.12ms
     90%    2.85s 
     99%    4.54s 
  174509 requests in 30.08s, 70.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 238
Requests/sec:   5800.65
Transfer/sec:      2.34MB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ http://172.18.0.4:80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   686.28ms    1.19s    5.00s    82.89%
    Req/Sec   580.06    380.87     1.66k    60.78%
  Latency Distribution
     50%   33.75ms
     75%  928.03ms
     90%    2.76s 
     99%    4.41s 
  178790 requests in 30.06s, 72.16MB read
  Socket errors: connect 0, read 0, write 0, timeout 218
Requests/sec:   5947.72
Transfer/sec:      2.40MB
RUN_RC_3=0

TOOL_RC=0