validacao/results/dvwa/no_waf/06_wrk.log
=== wrk | dvwa/no_waf | http://172.18.0.4:80 | 17/07/2026 20:43:59,21 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" http://172.18.0.4:80
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ http://172.18.0.4:80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   651.08ms    1.24s    5.00s    84.07%
    Req/Sec   726.45    536.86     4.76k    69.02%
  Latency Distribution
     50%   35.66ms
     75%  457.82ms
     90%    2.89s 
     99%    4.57s 
  160358 requests in 30.10s, 64.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 558
Requests/sec:   5327.70
Transfer/sec:      2.15MB
RUN_RC=0

TOOL_RC=0